dev-board-tech/multiPlatformCPP-SDK/sdk/platform/stm32f7/interface/screen.cpp
	/** @brief Toggle Sw reset of LTDC IP */
	__HAL_RCC_LTDC_FORCE_RESET();
	__HAL_RCC_LTDC_RELEASE_RESET();

	/** @brief Enable the DMA2D clock */
	__HAL_RCC_DMA2D_CLK_ENABLE()
	;

	/** @brief Toggle Sw reset of DMA2D IP */
	__HAL_RCC_DMA2D_FORCE_RESET();
	__HAL_RCC_DMA2D_RELEASE_RESET();

	/** @brief Enable DSI Host and wrapper clocks */
	__HAL_RCC_DSI_CLK_ENABLE()
	;

	/** @brief Soft Reset the DSI Host and wrapper */
	__HAL_RCC_DSI_FORCE_RESET();
	__HAL_RCC_DSI_RELEASE_RESET();

	/** @brief NVIC configuration for LTDC interrupt that is now enabled */
	HAL_NVIC_SetPriority((IRQn_Type) LTDC_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ((IRQn_Type) LTDC_IRQn);

	/** @brief NVIC configuration for DMA2D interrupt that is now enabled */
	HAL_NVIC_SetPriority((IRQn_Type) DMA2D_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ((IRQn_Type) DMA2D_IRQn);

	/** @brief NVIC configuration for DSI interrupt that is now enabled */
	HAL_NVIC_SetPriority((IRQn_Type) DSI_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ((IRQn_Type) DSI_IRQn);
}
/*******************************************************************************
 LTDC, DMA2D and DSI BSP Routines
 *******************************************************************************/

/**
 * @brief  Handles DSI interrupt request.
 * @note : Can be surcharged by application code implementation of the function.
 */
/*__weak void BSP_LCD_DSI_IRQHandler(void)
 {
 HAL_DSI_IRQHandler(&(hdsi_eval));
 }*/

#if defined(STM32F769xx) || defined(STM32F779xx)
#define LCD_DSI_ID              0x11
/**
 * @brief  Returns the ID of connected screen by checking the HDMI
 *        (adv7533 component) ID or LCD DSI (via TS ID) ID.
 * @param  None
 * @retval LCD ID
 */
static uint16_t LCD_IO_GetID(void)
{
#if defined(USE_LCD_HDMI)
	HDMI_IO_Init();

	HDMI_IO_Delay(60);

	if(ADV7533_ID == adv7533_drv.ReadID(ADV7533_CEC_DSI_I2C_ADDR))
	{
		return ADV7533_ID;
	}
	else if(HDMI_IO_Read(LCD_DSI_ADDRESS, LCD_DSI_ID_REG) == LCD_DSI_ID)
	{
		return LCD_DSI_ID;
	}
	else
	{
		return 0;
	}
#else
	return LCD_DSI_ID;
#endif /* USE_LCD_HDMI */
}

/**
 * @brief  Initializes the DSI LCD.
 * The ititialization is done as below:
 *     - DSI PLL ititialization
 *     - DSI ititialization
 *     - LTDC ititialization
 *     - OTM8009A LCD Display IC Driver ititialization
 * @param  None
 * @retval LCD state
 */
static uint8_t BSP_LCD_InitEx(void *screenHeandle)
{
	GI::Display::Display *pDisplay = (GI::Display::Display *) screenHeandle;
	DSI_PLLInitTypeDef dsiPllInit;
	uint32_t LcdClock = 27429; /*!< LcdClk = 27429 kHz */
	uint32_t Clockratio = 0;
	uint16_t read_id = 0;

	uint32_t laneByteClk_kHz = 0;
	uint32_t VSA; /*!< Vertical start active time in units of lines */
	uint32_t VBP; /*!< Vertical Back Porch time in units of lines */
	uint32_t VFP; /*!< Vertical Front Porch time in units of lines */
	uint32_t VACT; /*!< Vertical Active time in units of lines = imageSize Y in pixels to display */
	uint32_t HSA; /*!< Horizontal start active time in units of lcdClk */
	uint32_t HBP; /*!< Horizontal Back Porch time in units of lcdClk */
	uint32_t HFP; /*!< Horizontal Front Porch time in units of lcdClk */
	uint32_t HACT; /*!< Horizontal Active time in units of lcdClk = imageSize X in pixels to display */

	/* Toggle Hardware Reset of the DSI LCD using
	 * its XRES signal (active low) */
	BSP_LCD_Reset();

	/* Check the connected monitor */
	read_id = LCD_IO_GetID();

#if defined(USE_LCD_HDMI)
	if(read_id == ADV7533_ID)
	{
		return BSP_LCD_HDMIInitEx(HDMI_FORMAT_720_576);
	}
	else if(read_id != LCD_DSI_ID)
	{
		return LCD_ERROR;
	}
#else
	if (read_id != LCD_DSI_ID)
	{
		return LCD_ERROR;
	}
#endif /* USE_LCD_HDMI */

	/* Call first MSP Initialize only in case of first initialization
	 * This will set IP blocks LTDC, DSI and DMA2D
	 * - out of reset
	 * - clocked
	 * - NVIC IRQ related to IP blocks enabled
	 */
	BSP_LCD_MspInit();

	/*************************DSI Initialization***********************************/

	/* Base address of DSI Host/Wrapper registers to be set before calling De-Init */
	hdsi_eval.Instance = DSI;

	HAL_DSI_DeInit(&(hdsi_eval));

	dsiPllInit.PLLNDIV = 100;
	dsiPllInit.PLLIDF = DSI_PLL_IN_DIV5;
	dsiPllInit.PLLODF = DSI_PLL_OUT_DIV1;
	laneByteClk_kHz = 62500; /* 500 MHz / 8 = 62.5 MHz = 62500 kHz */

	/* Set number of Lanes */
	hdsi_eval.Init.NumberOfLanes = DSI_TWO_DATA_LANES;

	/* TXEscapeCkdiv = f(LaneByteClk)/15.62 = 4 */
	hdsi_eval.Init.TXEscapeCkdiv = laneByteClk_kHz / 15620;

	HAL_DSI_Init(&(hdsi_eval), &(dsiPllInit));
	Clockratio = laneByteClk_kHz / LcdClock;
	/* Timing parameters for all Video modes
	 * Set Timing parameters of LTDC depending on its chosen orientation
	 */
	VSA = pDisplay->LcdTimings->vsw; /* 12 */
	VBP = pDisplay->LcdTimings->vbp; /* 12 */
	VFP = pDisplay->LcdTimings->vfp; /* 12 */
	HSA = pDisplay->LcdTimings->hsw; /* 120 */
	HBP = pDisplay->LcdTimings->hbp; /* 120 */
	HFP = pDisplay->LcdTimings->hfp; /* 120 */
	HACT = pDisplay->LcdTimings->X;
	VACT = pDisplay->LcdTimings->Y;

	hdsivideo_handle.VirtualChannelID = LCD_OTM8009A_ID;
	hdsivideo_handle.ColorCoding = LCD_DSI_PIXEL_DATA_FMT_RBG888;
	hdsivideo_handle.VSPolarity = DSI_VSYNC_ACTIVE_HIGH;
	hdsivideo_handle.HSPolarity = DSI_HSYNC_ACTIVE_HIGH;
	hdsivideo_handle.DEPolarity = DSI_DATA_ENABLE_ACTIVE_HIGH;
	hdsivideo_handle.Mode = DSI_VID_MODE_BURST; /* Mode Video burst ie : one LgP per line */
	hdsivideo_handle.NullPacketSize = 0xFFF;
	hdsivideo_handle.NumberOfChunks = 0;
	hdsivideo_handle.PacketSize = HACT; /* Value depending on display orientation choice portrait/landscape */
	hdsivideo_handle.HorizontalSyncActive = HSA * Clockratio;
	hdsivideo_handle.HorizontalBackPorch = HBP * Clockratio;
	hdsivideo_handle.HorizontalLine = (HACT + HSA + HBP + HFP) * Clockratio; /* Value depending on display orientation choice portrait/landscape */
	hdsivideo_handle.VerticalSyncActive = VSA;
	hdsivideo_handle.VerticalBackPorch = VBP;
	hdsivideo_handle.VerticalFrontPorch = VFP;
	hdsivideo_handle.VerticalActive = VACT; /* Value depending on display orientation choice portrait/landscape */

	/* Enable or disable sending LP command while streaming is active in video mode */
	hdsivideo_handle.LPCommandEnable = DSI_LP_COMMAND_ENABLE; /* Enable sending commands in mode LP (Low Power) */

	/* Largest packet size possible to transmit in LP mode in VSA, VBP, VFP regions */
	/* Only useful when sending LP packets is allowed while streaming is active in video mode */
	hdsivideo_handle.LPLargestPacketSize = 64;

	/* Largest packet size possible to transmit in LP mode in HFP region during VACT period */
	/* Only useful when sending LP packets is allowed while streaming is active in video mode */
	hdsivideo_handle.LPVACTLargestPacketSize = 0;

	/* Specify for each region of the video frame, if the transmission of command in LP mode is allowed in this region */
	/* while streaming is active in video mode                                                                         */
	hdsivideo_handle.LPHorizontalFrontPorchEnable = DSI_LP_HFP_ENABLE; /* Allow sending LP commands during HFP period */
	hdsivideo_handle.LPHorizontalBackPorchEnable = DSI_LP_HBP_ENABLE; /* Allow sending LP commands during HBP period */
	hdsivideo_handle.LPVerticalActiveEnable = DSI_LP_VACT_ENABLE; /* Allow sending LP commands during VACT period */
	hdsivideo_handle.LPVerticalFrontPorchEnable = DSI_LP_VFP_ENABLE; /* Allow sending LP commands during VFP period */
	hdsivideo_handle.LPVerticalBackPorchEnable = DSI_LP_VBP_ENABLE; /* Allow sending LP commands during VBP period */
	hdsivideo_handle.LPVerticalSyncActiveEnable = DSI_LP_VSYNC_ENABLE; /* Allow sending LP commands during VSync = VSA period */

	/* Configure DSI Video mode timings with settings set above */
	HAL_DSI_ConfigVideoMode(&(hdsi_eval), &(hdsivideo_handle));

