dev-board-tech/multiPlatformCPP-SDK/sdk/platform/stm32f7/interface/screen.cpp
	 //Calculate the destination locations on the screen.
	 dest_rectangle->sXMin += dest_X_StartBox;
	 dest_rectangle->sXMax += dest_X_StartBox;
	 dest_rectangle->sYMin += dest_Y_StartBox;
	 dest_rectangle->sYMax += dest_Y_StartBox;
	 if(dest_rectangle->sXMax < sClipRegion.sXMin ||
	 dest_rectangle->sYMax < sClipRegion.sYMin ||
	 dest_rectangle->sXMin >= sClipRegion.sXMax ||
	 dest_rectangle->sYMin >= sClipRegion.sYMax)
	 return;

	 //Limit the destination area to the picture box size.
	 clip_limit(dest_rectangle, &sClipRegion);

	 si x_line_len = dest_rectangle->sXMax - dest_rectangle->sXMin;

	 if(x_line_len <= 0)
	 return;
	 if(dest_X_StartBox <= dest_rectangle->sXMin)
	 dest_X_StartBox = dest_rectangle->sXMin;

	 si Y_cnt = dest_Y_StartBox;
	 if(Y_cnt <= dest_rectangle->sYMin)
	 Y_cnt = dest_rectangle->sYMin;

	 si X_Start_Src_Buff = sClipRegion.sXMin;
	 if(X_Start_Src_Buff > 0)
	 X_Start_Src_Buff = 0;
	 else
	 X_Start_Src_Buff = (~X_Start_Src_Buff) + 1;
	 si Y_Start_Src_Buff = sClipRegion.sYMin;
	 if(Y_Start_Src_Buff > 0)
	 Y_Start_Src_Buff = 0;
	 else
	 Y_Start_Src_Buff = (~Y_Start_Src_Buff) + 1;*/

	uint32_t destination = (uint32_t) ((volatile ui *) LCD_FB_START_ADDRESS) + (((y1 * driverHandler->LcdTimings->X) + x1) * 4);
	uint32_t source = (uint32_t) rgb_buffer;

	/*##-1- Configure the DMA2D Mode, Color Mode and output offset #############*/
	Dma2dHandle.Init.Mode = DMA2D_M2M;
	Dma2dHandle.Init.ColorMode = DMA2D_ARGB8888;
	Dma2dHandle.Init.OutputOffset = (driverHandler->LcdTimings->X - width) * 2;

	/*##-2- DMA2D Callbacks Configuration ######################################*/
	Dma2dHandle.XferCpltCallback = NULL;

	/*##-3- Foreground Configuration ###########################################*/
	Dma2dHandle.LayerCfg[0].AlphaMode = DMA2D_NO_MODIF_ALPHA;
	Dma2dHandle.LayerCfg[0].InputAlpha = 0xFF;
	Dma2dHandle.LayerCfg[0].InputColorMode = CM_ARGB8888;
	Dma2dHandle.LayerCfg[0].InputOffset = 0;

	Dma2dHandle.Instance = DMA2D;

	/* DMA2D Initialization */
	if (HAL_DMA2D_Init(&Dma2dHandle) == HAL_OK)
	{
		if (HAL_DMA2D_ConfigLayer(&Dma2dHandle, 0) == HAL_OK)
		{
			if (HAL_DMA2D_Start(&Dma2dHandle, source, destination, width * 2, height) == HAL_OK)
			{
				/* Polling For DMA transfer */
				HAL_DMA2D_PollForTransfer(&Dma2dHandle, 100);
			}
		}
	}
}
//#######################################################################################
void GI::Device::Display::IntScreen::_drawHLine(void *driverHandlerPtr, si X1, ui X2, si Y,
		u8 width, u32 color)
{
	GI::Device::Display::IntScreen *driverHandler = (GI::Device::Display::IntScreen *)driverHandlerPtr;
	if (width == 1 && (Y < driverHandler->sClipRegion.sYMin || Y >= driverHandler->sClipRegion.sYMax))
		return;
	register int X1_Tmp = X1, X2_Tmp = X1 + X2;
	if (X1_Tmp <= (int) driverHandler->sClipRegion.sXMin)
		X1_Tmp = (int) driverHandler->sClipRegion.sXMin;
	if (X1_Tmp >= (int) driverHandler->sClipRegion.sXMax)
		X1_Tmp = (int) driverHandler->sClipRegion.sXMax;
	if (X2_Tmp <= (int) driverHandler->sClipRegion.sXMin)
		X2_Tmp = (int) driverHandler->sClipRegion.sXMin;
	if (X2_Tmp >= (int) driverHandler->sClipRegion.sXMax)
		X2_Tmp = (int) driverHandler->sClipRegion.sXMax;
	Y -= (width >> 1);
	if (Y < (int) driverHandler->sClipRegion.sYMin)
		Y = (int) driverHandler->sClipRegion.sYMin;
	if (Y >= (int) driverHandler->sClipRegion.sYMax)
		Y = (int) driverHandler->sClipRegion.sYMax;
#ifdef USE_16_BIT_COLOR_DEPTH
	ui _color = color;
#else
	ui _color = color | 0xFF000000;
#endif
	uint32_t Xaddress = 0;
	Xaddress = (LtdcHandler.LayerCfg[0].FBStartAdress)
			+ 4 * (driverHandler->LcdTimings->X * Y + X1_Tmp);
	/* Fill the rectangle */
	LL_FillBuffer(0, (uint32_t *) Xaddress, X2_Tmp - X1_Tmp, width,
			driverHandler->LcdTimings->X - (X2_Tmp - X1_Tmp), _color);

}
//#######################################################################################
void GI::Device::Display::IntScreen::_drawVLine(void *driverHandlerPtr, si Y1, ui Y2, si X,
		u8 width, u32 color)
{
	GI::Device::Display::IntScreen *driverHandler = (GI::Device::Display::IntScreen *)driverHandlerPtr;
	if (width == 1 && (X < driverHandler->sClipRegion.sXMin || X >= driverHandler->sClipRegion.sXMax))
		return;
	register int Y1_Tmp = Y1, Y2_Tmp = Y1 + Y2;
	X -= (width >> 1);
	if (X <= (int) driverHandler->sClipRegion.sXMin)
		X = (int) driverHandler->sClipRegion.sXMin;
	if (X >= (int) driverHandler->sClipRegion.sXMax)
		X = (int) driverHandler->sClipRegion.sXMax;
	if (Y1_Tmp <= (int) driverHandler->sClipRegion.sYMin)
		Y1_Tmp = (int) driverHandler->sClipRegion.sYMin;
	if (Y1_Tmp >= (int) driverHandler->sClipRegion.sYMax)
		Y1_Tmp = (int) driverHandler->sClipRegion.sYMax;
	if (Y2_Tmp <= (int) driverHandler->sClipRegion.sYMin)
		Y2_Tmp = (int) driverHandler->sClipRegion.sYMin;
	if (Y2_Tmp >= (int) driverHandler->sClipRegion.sYMax)
		Y2_Tmp = (int) driverHandler->sClipRegion.sYMax;
#ifdef USE_16_BIT_COLOR_DEPTH
	ui _color = color;
#else
	ui _color = color | 0xFF000000;
#endif
	uint32_t Xaddress = 0;
	Xaddress = (LtdcHandler.LayerCfg[0].FBStartAdress)
			+ 4 * (driverHandler->LcdTimings->X * Y1_Tmp + X);
	/* Fill the rectangle */
	LL_FillBuffer(0, (uint32_t *) Xaddress, width, Y2_Tmp - Y1_Tmp,
			driverHandler->LcdTimings->X - (width), _color);

}
//#######################################################################################
void GI::Device::Display::IntScreen::_clear(void *driverHandlerPtr, u32 color)
{
	GI::Device::Display::IntScreen *driverHandler = (GI::Device::Display::IntScreen *)driverHandlerPtr;
	driverHandler->drawRectangle(0, 0, driverHandler->LcdTimings->X, driverHandler->LcdTimings->Y, true, color);
}
//#######################################################################################

#else
#endif
